Revit 2026 API

# ElectricalSystemVoltageDrop Property

---

**Note: This API is now obsolete.**

The VoltageDrop value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. There is no replacement for this property because Revit no longer supports this.")]
public double VoltageDrop { get; }
```
```vb
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. There is no replacement for this property because Revit no longer supports this.")>
Public ReadOnly Property VoltageDrop As Double
	Get
```
```cpp
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a future version of Revit. There is no replacement for this property because Revit no longer supports this.")]
property double VoltageDrop {
	double get ();
}
```
```fsharp
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. There is no replacement for this property because Revit no longer supports this.")>]
member VoltageDrop : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the VoltageDrop value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace